k6_tests/benchmark_before.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 55s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 25s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 10/50 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10/50 VUs  01.0s/25.0s

running (02.0s), 20/50 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 20/50 VUs  02.0s/25.0s

running (03.0s), 30/50 VUs, 19 complete and 0 interrupted iterations
default   [  12% ] 30/50 VUs  03.0s/25.0s

running (04.0s), 40/50 VUs, 36 complete and 0 interrupted iterations
default   [  16% ] 40/50 VUs  04.0s/25.0s

running (05.0s), 49/50 VUs, 56 complete and 0 interrupted iterations
default   [  20% ] 49/50 VUs  05.0s/25.0s

running (06.0s), 50/50 VUs, 82 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  06.0s/25.0s

running (07.0s), 50/50 VUs, 105 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  07.0s/25.0s

running (08.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  08.0s/25.0s

running (09.0s), 50/50 VUs, 147 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  09.0s/25.0s

running (10.0s), 50/50 VUs, 175 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  10.0s/25.0s

running (11.0s), 50/50 VUs, 204 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  11.0s/25.0s

running (12.0s), 50/50 VUs, 231 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  12.0s/25.0s

running (13.0s), 50/50 VUs, 247 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  13.0s/25.0s

running (14.0s), 50/50 VUs, 278 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  14.0s/25.0s

running (15.0s), 50/50 VUs, 306 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  15.0s/25.0s

running (16.0s), 50/50 VUs, 330 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  16.0s/25.0s

running (17.0s), 50/50 VUs, 358 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  17.0s/25.0s

running (18.0s), 50/50 VUs, 379 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  18.0s/25.0s

running (19.0s), 50/50 VUs, 402 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  19.0s/25.0s

running (20.0s), 50/50 VUs, 436 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  20.0s/25.0s

running (21.0s), 46/50 VUs, 463 complete and 0 interrupted iterations
default   [  84% ] 46/50 VUs  21.0s/25.0s

running (22.0s), 43/50 VUs, 476 complete and 0 interrupted iterations
default   [  88% ] 43/50 VUs  22.0s/25.0s

running (23.0s), 26/50 VUs, 518 complete and 0 interrupted iterations
default   [  92% ] 26/50 VUs  23.0s/25.0s

running (24.0s), 18/50 VUs, 535 complete and 0 interrupted iterations
default   [  96% ] 18/50 VUs  24.0s/25.0s

running (25.0s), 07/50 VUs, 553 complete and 0 interrupted iterations
default   [ 100% ] 07/50 VUs  25.0s/25.0s


  █ TOTAL RESULTS 

    checks_total.......: 560     21.778414/s
    checks_succeeded...: 100.00% 560 out of 560
    checks_failed......: 0.00%   0 out of 560

    ✓ is status 200

    HTTP
    http_req_duration..............: avg=859.39ms min=39.23ms med=827.05ms max=2.55s p(90)=1.4s p(95)=1.59s
      { expected_response:true }...: avg=859.39ms min=39.23ms med=827.05ms max=2.55s p(90)=1.4s p(95)=1.59s
    http_req_failed................: 0.00%  0 out of 560
    http_reqs......................: 560    21.778414/s

    EXECUTION
    iteration_duration.............: avg=1.86s    min=1.04s   med=1.82s    max=3.55s p(90)=2.4s p(95)=2.6s 
    iterations.....................: 560    21.778414/s
    vus............................: 7      min=7        max=50
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 533 kB 21 kB/s
    data_sent......................: 81 kB  3.2 kB/s



running (25.7s), 00/50 VUs, 560 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  25s